zephyrproject-rtos/zephyr/ext/hal/st/stm32cube/stm32mp1xx/drivers/include/stm32mp1xx_hal_rcc_ex.h
/**
  ******************************************************************************
  * @file    stm32mp1xx_hal_rcc_ex.h
  * @author  MCD Application Team
  * @brief   Header file of RCC HAL Extension module.
  ******************************************************************************
  * @attention
  *
  * <h2><center>&copy; Copyright (c) 2019 STMicroelectronics.
  * All rights reserved.</center></h2>
  *
  * This software component is licensed by ST under BSD 3-Clause license,
  * the "License"; You may not use this file except in compliance with the
  * License. You may obtain a copy of the License at:
  *                        opensource.org/licenses/BSD-3-Clause
  *
  ******************************************************************************
  */

/* Define to prevent recursive inclusion -------------------------------------*/
#ifndef __STM32MP1xx_HAL_RCC_EX_H
#define __STM32MP1xx_HAL_RCC_EX_H

#ifdef __cplusplus
extern "C" {
#endif

/* Includes ------------------------------------------------------------------*/
#include "stm32mp1xx_hal_def.h"

/** @addtogroup STM32MP1xx_HAL_Driver
  * @{
  */

/** @addtogroup RCCEx
  * @{
  */

/* Exported types ------------------------------------------------------------*/
/** @defgroup RCCEx_Exported_Types RCCEx Exported Types
  * @{
  */
/**
  * @brief  RCC extended clocks structure definition
  */
typedef struct
{
  uint64_t PeriphClockSelection;   /*!< The Extended Clock to be configured.
                                        This parameter can be a value of @ref
                                        RCCEx_Periph_Clock_Selection */

  RCC_PLLInitTypeDef PLL2;         /*!< PLL2 structure parameters.
                                        This parameter will be used only when
                                        PLL2 is selected as Clock Source */

  RCC_PLLInitTypeDef PLL3;         /*!< PLL3 structure parameters.
                                        This parameter will be used only when
                                        PLL3 is selected as Clock Source */

  RCC_PLLInitTypeDef PLL4;         /*!< PLL4 structure parameters.
                                        This parameter will be used only when
                                        PLL3 is selected as Clock Source */

  uint32_t I2c12ClockSelection;    /*!< Specifies I2C12 clock source
                                        This parameter can be a value of
                                        @ref RCCEx_I2C12_Clock_Source */

  uint32_t I2c35ClockSelection;    /*!< Specifies I2C35 clock source
                                        This parameter can be a value of
                                        @ref RCCEx_I2C35_Clock_Source */

  uint32_t I2c46ClockSelection;    /*!< Specifies I2C46 clock source
                                        This parameter can be a value of
                                        @ref RCCEx_I2C46_Clock_Source */

  uint32_t Sai1ClockSelection;     /*!< Specifies SAI1 clock source
                                        This parameter can be a value of @ref
                                        RCCEx_SAI1_Clock_Source */

  uint32_t Sai2ClockSelection;     /*!< Specifies SAI2 clock source
                                        This parameter can be a value of @ref
                                        RCCEx_SAI2_Clock_Source */

  uint32_t Sai3ClockSelection;     /*!< Specifies SAI3 clock source
                                        This parameter can be a value of @ref
                                        RCCEx_SAI3_Clock_Source */

  uint32_t Sai4ClockSelection;     /*!< Specifies SAI4 clock source
                                        This parameter can be a value of @ref
                                        RCCEx_SAI4_Clock_Source */

  uint32_t Spi1ClockSelection;     /*!< Specifies SPI1 clock source
                                        This parameter can be a value of @ref
                                        RCCEx_SPI1_Clock_Source */

  uint32_t Spi23ClockSelection;    /*!< Specifies SPI23 clock source
                                         This parameter can be a value of @ref
                                         RCCEx_SPI23_Clock_Source */

  uint32_t Spi45ClockSelection;    /*!< Specifies SPI45 clock source
                                         This parameter can be a value of @ref
                                         RCCEx_SPI45_Clock_Source */

  uint32_t Spi6ClockSelection;     /*!< Specifies SPI6 clock source
                                        This parameter can be a value of @ref
                                        RCCEx_SPI6_Clock_Source */

  uint32_t Usart1ClockSelection;   /*!< Specifies USART1 clock source
                                        This parameter can be a value of @ref
                                        RCCEx_USART1_Clock_Source */

  uint32_t Uart24ClockSelection;   /*!< Specifies UART24 clock source
                                        This parameter can be a value of @ref
                                        RCCEx_UART24_Clock_Source */

  uint32_t Uart35ClockSelection;   /*!< Specifies UART35 clock source
                                         This parameter can be a value of @ref
                                         RCCEx_UART35_Clock_Source */

  uint32_t Usart6ClockSelection;   /*!< Specifies USART6 clock source
                                        This parameter can be a value of @ref
                                        RCCEx_USART6_Clock_Source */

  uint32_t Uart78ClockSelection;   /*!< Specifies UART78 clock source
                                        This parameter can be a value of @ref
                                        RCCEx_UART78_Clock_Source */

  uint32_t Sdmmc12ClockSelection; /*!< Specifies SDMMC12 clock source
                                        This parameter can be a value of @ref
                                        RCCEx_SDMMC12_Clock_Source */

  uint32_t Sdmmc3ClockSelection;  /*!< Specifies SDMMC3 clock source
                                        This parameter can be a value of @ref
                                         RCCEx_SDMMC3_Clock_Source */

  uint32_t EthClockSelection;     /*!< Specifies ETH clock source
                                         This parameter can be a value of @ref
                                         RCCEx_ETH_Clock_Source */

  uint32_t FmcClockSelection;      /*!< Specifies FMC clock source
                                        This parameter can be a value of @ref
                                        RCCEx_FMC_Clock_Source */

