zephyrproject-rtos/zephyr/ext/hal/st/stm32cube/stm32mp1xx/drivers/include/stm32mp1xx_hal_rcc_ex.h
  uint32_t QspiClockSelection;     /*!< Specifies QSPI clock source
                                        This parameter can be a value of @ref
                                        RCCEx_QSPI_Clock_Source */

  uint32_t DsiClockSelection;      /*!< Specifies DSI clock source
                                        This parameter can be a value of @ref
                                        RCCEx_DSI_Clock_Source */

  uint32_t CkperClockSelection;    /*!< Specifies CKPER clock source
                                        This parameter can be a value of @ref
                                        RCCEx_CKPER_Clock_Source */

  uint32_t SpdifrxClockSelection;  /*!< Specifies SPDIFRX Clock clock source
                                        This parameter can be a value of @ref
                                        RCCEx_SPDIFRX_Clock_Source */

  uint32_t FdcanClockSelection;    /*!< Specifies FDCAN Clock clock source
                                        This parameter can be a value of @ref
                                        RCCEx_FDCAN_Clock_Source */

  uint32_t Rng1ClockSelection;     /*!< Specifies RNG1 clock source
                                        This parameter can be a value of @ref
                                        RCCEx_RNG1_Clock_Source */

  uint32_t Rng2ClockSelection;     /*!< Specifies RNG2 clock source
                                        This parameter can be a value of @ref
                                        RCCEx_RNG2_Clock_Source */

  uint32_t StgenClockSelection;    /*!< Specifies STGEN clock source
                                        This parameter can be a value of @ref
                                        RCCEx_STGEN_Clock_Source */

  uint32_t UsbphyClockSelection;   /*!< Specifies USB PHY clock source
                                        This parameter can be a value of @ref
                                        RCCEx_USBPHY_Clock_Source */

  uint32_t UsboClockSelection;     /*!< Specifies USB OTG clock source
                                        This parameter can be a value of @ref
                                        RCCEx_USBO_Clock_Source */

  uint32_t CecClockSelection;      /*!< Specifies CEC clock source
                                        This parameter can be a value of @ref
                                        RCCEx_CEC_Clock_Source */

  uint32_t Lptim1ClockSelection;   /*!< Specifies LPTIM1 clock source
                                        This parameter can be a value of @ref
                                        RCCEx_LPTIM1_Clock_Source */

  uint32_t Lptim23ClockSelection;  /*!< Specifies LPTIM23 clock source
                                        This parameter can be a value of @ref
                                        RCCEx_LPTIM23_Clock_Source */

  uint32_t Lptim45ClockSelection;  /*!< Specifies LPTIM45 clock source
                                        This parameter can be a value of @ref
                                        RCCEx_LPTIM45_Clock_Source */

  uint32_t AdcClockSelection;      /*!< Specifies ADC interface clock source
                                        This parameter can be a value of @ref
                                        RCCEx_ADC_Clock_Source */

  uint32_t RTCClockSelection;      /*!< Specifies RTC clock source
                                        This parameter can be a value of @ref
                                        RCC_RTC_Clock_Source */

  uint32_t TIMG1PresSelection;     /*!< Specifies TIM Group 1 Clock Prescalers
                                        Selection.
                                        This parameter can be a value of @ref
                                        RCCEx_TIMG1_Prescaler_Selection */

  uint32_t TIMG2PresSelection;     /*!< Specifies TIM Group 2 Clock Prescalers
                                        Selection.
                                        This parameter can be a value of @ref
                                        RCCEx_TIMG2_Prescaler_Selection */
} RCC_PeriphCLKInitTypeDef;
/**
  * @}
  */

/* Exported constants --------------------------------------------------------*/
/** @defgroup RCCEx_Exported_Constants RCCEx Exported Constants
  * @{
  */

/** @defgroup RCCEx_Periph_Clock_Selection RCCEx_Periph_Clock_Selection
  * @{
  */
#define RCC_PERIPHCLK_USART1            ((uint64_t)0x00000001)
#define RCC_PERIPHCLK_UART24            ((uint64_t)0x00000002)
#define RCC_PERIPHCLK_UART35            ((uint64_t)0x00000004)
#define RCC_PERIPHCLK_ADC               ((uint64_t)0x00000008)
#define RCC_PERIPHCLK_I2C12             ((uint64_t)0x00000010)
#define RCC_PERIPHCLK_I2C35             ((uint64_t)0x00000020)
#define RCC_PERIPHCLK_LPTIM1            ((uint64_t)0x00000040)
#define RCC_PERIPHCLK_SAI1              ((uint64_t)0x00000080)
#define RCC_PERIPHCLK_SAI2              ((uint64_t)0x00000100)
#define RCC_PERIPHCLK_USBPHY            ((uint64_t)0x00000200)
#define RCC_PERIPHCLK_TIMG1             ((uint64_t)0x00000400)
#define RCC_PERIPHCLK_TIMG2             ((uint64_t)0x00000800)
#define RCC_PERIPHCLK_RTC               ((uint64_t)0x00001000)
#define RCC_PERIPHCLK_CEC               ((uint64_t)0x00002000)
#define RCC_PERIPHCLK_USART6            ((uint64_t)0x00004000)
#define RCC_PERIPHCLK_UART78            ((uint64_t)0x00008000)
#define RCC_PERIPHCLK_LPTIM23           ((uint64_t)0x00010000)
#define RCC_PERIPHCLK_LPTIM45           ((uint64_t)0x00020000)
#define RCC_PERIPHCLK_SAI3              ((uint64_t)0x00040000)
#define RCC_PERIPHCLK_USBO              ((uint64_t)0x00080000)
#define RCC_PERIPHCLK_FMC               ((uint64_t)0x00100000)
#define RCC_PERIPHCLK_QSPI              ((uint64_t)0x00200000)
#define RCC_PERIPHCLK_DSI               ((uint64_t)0x00400000)
#define RCC_PERIPHCLK_CKPER             ((uint64_t)0x00800000)
#define RCC_PERIPHCLK_SPDIFRX           ((uint64_t)0x01000000)
#define RCC_PERIPHCLK_FDCAN             ((uint64_t)0x02000000)
#define RCC_PERIPHCLK_SPI1              ((uint64_t)0x04000000)
#define RCC_PERIPHCLK_SPI23             ((uint64_t)0x08000000)
#define RCC_PERIPHCLK_SPI45             ((uint64_t)0x10000000)
#define RCC_PERIPHCLK_SPI6              ((uint64_t)0x20000000)
#define RCC_PERIPHCLK_SAI4              ((uint64_t)0x40000000)
#define RCC_PERIPHCLK_SDMMC12           ((uint64_t)0x80000000)
#define RCC_PERIPHCLK_SDMMC3            ((uint64_t)0x100000000)
#define RCC_PERIPHCLK_ETH               ((uint64_t)0x200000000)
#define RCC_PERIPHCLK_RNG1              ((uint64_t)0x400000000)
#define RCC_PERIPHCLK_RNG2              ((uint64_t)0x800000000)
#define RCC_PERIPHCLK_STGEN             ((uint64_t)0x1000000000)
#define RCC_PERIPHCLK_I2C46             ((uint64_t)0x2000000000)

#define IS_RCC_PERIPHCLOCK(SELECTION) \
          ((((SELECTION) & RCC_PERIPHCLK_USART1)  == RCC_PERIPHCLK_USART1)  || \
           (((SELECTION) & RCC_PERIPHCLK_UART24)  == RCC_PERIPHCLK_UART24)  || \
           (((SELECTION) & RCC_PERIPHCLK_UART35)  == RCC_PERIPHCLK_UART35)  || \
           (((SELECTION) & RCC_PERIPHCLK_I2C12)   == RCC_PERIPHCLK_I2C12)   || \
           (((SELECTION) & RCC_PERIPHCLK_I2C35)   == RCC_PERIPHCLK_I2C35)   || \
           (((SELECTION) & RCC_PERIPHCLK_LPTIM1)  == RCC_PERIPHCLK_LPTIM1)  || \
           (((SELECTION) & RCC_PERIPHCLK_SAI1)    == RCC_PERIPHCLK_SAI1)    || \
           (((SELECTION) & RCC_PERIPHCLK_SAI2)    == RCC_PERIPHCLK_SAI2)    || \
           (((SELECTION) & RCC_PERIPHCLK_USBPHY)  == RCC_PERIPHCLK_USBPHY)  || \
           (((SELECTION) & RCC_PERIPHCLK_ADC)     == RCC_PERIPHCLK_ADC)     || \
           (((SELECTION) & RCC_PERIPHCLK_RTC)     == RCC_PERIPHCLK_RTC)     || \
           (((SELECTION) & RCC_PERIPHCLK_CEC)     == RCC_PERIPHCLK_CEC)     || \
           (((SELECTION) & RCC_PERIPHCLK_USART6)  == RCC_PERIPHCLK_USART6)  || \
           (((SELECTION) & RCC_PERIPHCLK_UART78)  == RCC_PERIPHCLK_UART78)  || \
           (((SELECTION) & RCC_PERIPHCLK_I2C46)   == RCC_PERIPHCLK_I2C46)   || \
           (((SELECTION) & RCC_PERIPHCLK_LPTIM23) == RCC_PERIPHCLK_LPTIM23) || \
           (((SELECTION) & RCC_PERIPHCLK_LPTIM45) == RCC_PERIPHCLK_LPTIM45) || \
           (((SELECTION) & RCC_PERIPHCLK_SAI3)    == RCC_PERIPHCLK_SAI3)    || \
           (((SELECTION) & RCC_PERIPHCLK_FMC)     == RCC_PERIPHCLK_FMC)     || \
           (((SELECTION) & RCC_PERIPHCLK_QSPI)    == RCC_PERIPHCLK_QSPI)    || \
           (((SELECTION) & RCC_PERIPHCLK_DSI)     == RCC_PERIPHCLK_DSI)     || \
           (((SELECTION) & RCC_PERIPHCLK_CKPER)   == RCC_PERIPHCLK_CKPER)   || \
           (((SELECTION) & RCC_PERIPHCLK_SPDIFRX) == RCC_PERIPHCLK_SPDIFRX) || \
           (((SELECTION) & RCC_PERIPHCLK_FDCAN)   == RCC_PERIPHCLK_FDCAN)   || \
           (((SELECTION) & RCC_PERIPHCLK_SPI1)    == RCC_PERIPHCLK_SPI1)    || \
           (((SELECTION) & RCC_PERIPHCLK_SPI23)   == RCC_PERIPHCLK_SPI23)   || \
           (((SELECTION) & RCC_PERIPHCLK_SPI45)   == RCC_PERIPHCLK_SPI45)   || \
           (((SELECTION) & RCC_PERIPHCLK_SPI6)    == RCC_PERIPHCLK_SPI6)    || \
           (((SELECTION) & RCC_PERIPHCLK_SAI4)    == RCC_PERIPHCLK_SAI4)    || \
           (((SELECTION) & RCC_PERIPHCLK_SDMMC12) == RCC_PERIPHCLK_SDMMC12) || \
           (((SELECTION) & RCC_PERIPHCLK_SDMMC3)  == RCC_PERIPHCLK_SDMMC3)  || \
           (((SELECTION) & RCC_PERIPHCLK_ETH)     == RCC_PERIPHCLK_ETH)     || \
           (((SELECTION) & RCC_PERIPHCLK_RNG1)    == RCC_PERIPHCLK_RNG1)    || \
           (((SELECTION) & RCC_PERIPHCLK_RNG2)    == RCC_PERIPHCLK_RNG2)    || \
           (((SELECTION) & RCC_PERIPHCLK_USBO)    == RCC_PERIPHCLK_USBO)    || \
           (((SELECTION) & RCC_PERIPHCLK_STGEN)   == RCC_PERIPHCLK_STGEN)   || \
           (((SELECTION) & RCC_PERIPHCLK_TIMG1)   == RCC_PERIPHCLK_TIMG1)   || \
           (((SELECTION) & RCC_PERIPHCLK_TIMG2)   == RCC_PERIPHCLK_TIMG2))
/**
  * @}
  */

/** @defgroup RCCEx_Periph_One_Clock RCCEx_Periph_One_Clock
  * @{
  */
#define RCC_PERIPHCLK_DAC               ((uint64_t)0x4000000000)
#define RCC_PERIPHCLK_LTDC              ((uint64_t)0x8000000000)
#define RCC_PERIPHCLK_DFSDM1            ((uint64_t)0x10000000000)
#define RCC_PERIPHCLK_TEMP              ((uint64_t)0x20000000000)
#define RCC_PERIPHCLK_IWDG1             ((uint64_t)0x40000000000)
#define RCC_PERIPHCLK_DDRPHYC           ((uint64_t)0x80000000000)
#define RCC_PERIPHCLK_IWDG2             ((uint64_t)0x100000000000)
#define RCC_PERIPHCLK_GPU               ((uint64_t)0x200000000000)
#define RCC_PERIPHCLK_WWDG              ((uint64_t)0x400000000000)
#define RCC_PERIPHCLK_TIM2              RCC_PERIPHCLK_TIMG1
#define RCC_PERIPHCLK_TIM3              RCC_PERIPHCLK_TIMG1
#define RCC_PERIPHCLK_TIM4              RCC_PERIPHCLK_TIMG1
#define RCC_PERIPHCLK_TIM5              RCC_PERIPHCLK_TIMG1
#define RCC_PERIPHCLK_TIM6              RCC_PERIPHCLK_TIMG1
#define RCC_PERIPHCLK_TIM7              RCC_PERIPHCLK_TIMG1
#define RCC_PERIPHCLK_TIM12             RCC_PERIPHCLK_TIMG1
#define RCC_PERIPHCLK_TIM13             RCC_PERIPHCLK_TIMG1
#define RCC_PERIPHCLK_TIM14             RCC_PERIPHCLK_TIMG1
#define RCC_PERIPHCLK_TIM1              RCC_PERIPHCLK_TIMG2
#define RCC_PERIPHCLK_TIM8              RCC_PERIPHCLK_TIMG2
#define RCC_PERIPHCLK_TIM15             RCC_PERIPHCLK_TIMG2
#define RCC_PERIPHCLK_TIM16             RCC_PERIPHCLK_TIMG2
#define RCC_PERIPHCLK_TIM17             RCC_PERIPHCLK_TIMG2

#define IS_RCC_PERIPHONECLOCK(PERIPH) \
          ((((PERIPH) & RCC_PERIPHCLK_DAC)      == RCC_PERIPHCLK_DAC)     || \
           (((PERIPH) & RCC_PERIPHCLK_LTDC)     == RCC_PERIPHCLK_LTDC)    || \
           (((PERIPH) & RCC_PERIPHCLK_DFSDM1)   == RCC_PERIPHCLK_DFSDM1)  || \
           (((PERIPH) & RCC_PERIPHCLK_TEMP)     == RCC_PERIPHCLK_TEMP)    || \
           (((PERIPH) & RCC_PERIPHCLK_IWDG1)    == RCC_PERIPHCLK_IWDG1)   || \
           (((PERIPH) & RCC_PERIPHCLK_IWDG2)    == RCC_PERIPHCLK_IWDG2)   || \
           (((PERIPH) & RCC_PERIPHCLK_WWDG)     == RCC_PERIPHCLK_WWDG)    || \
           (((PERIPH) & RCC_PERIPHCLK_DDRPHYC)  == RCC_PERIPHCLK_DDRPHYC) || \
           (((PERIPH) & RCC_PERIPHCLK_GPU)      == RCC_PERIPHCLK_GPU)     || \
           (((PERIPH) & RCC_PERIPHCLK_TIMG1)    == RCC_PERIPHCLK_TIMG1)   || \
           (((PERIPH) & RCC_PERIPHCLK_TIMG2)    == RCC_PERIPHCLK_TIMG2))
/**
  * @}
  */

/** @defgroup RCCEx_I2C12_Clock_Source  I2C12 Clock Source
  * @{
  */
#define RCC_I2C12CLKSOURCE_BCLK         RCC_I2C12CKSELR_I2C12SRC_0
#define RCC_I2C12CLKSOURCE_PLL4         RCC_I2C12CKSELR_I2C12SRC_1
#define RCC_I2C12CLKSOURCE_HSI          RCC_I2C12CKSELR_I2C12SRC_2
#define RCC_I2C12CLKSOURCE_CSI          RCC_I2C12CKSELR_I2C12SRC_3

#define IS_RCC_I2C12CLKSOURCE(SOURCE) \
                              (((SOURCE) == RCC_I2C12CLKSOURCE_BCLK)   || \
                               ((SOURCE) == RCC_I2C12CLKSOURCE_PLL4)   || \
                               ((SOURCE) == RCC_I2C12CLKSOURCE_HSI)    || \
                               ((SOURCE) == RCC_I2C12CLKSOURCE_CSI))
/**
  * @}
  */

/** @defgroup RCCEx_I2C35_Clock_Source I2C35 Clock Source
  * @{
  */
#define RCC_I2C35CLKSOURCE_BCLK         RCC_I2C35CKSELR_I2C35SRC_0
#define RCC_I2C35CLKSOURCE_PLL4         RCC_I2C35CKSELR_I2C35SRC_1
#define RCC_I2C35CLKSOURCE_HSI          RCC_I2C35CKSELR_I2C35SRC_2
#define RCC_I2C35CLKSOURCE_CSI          RCC_I2C35CKSELR_I2C35SRC_3

#define IS_RCC_I2C35CLKSOURCE(SOURCE) \
                              (((SOURCE) == RCC_I2C35CLKSOURCE_BCLK)  || \
                               ((SOURCE) == RCC_I2C35CLKSOURCE_PLL4)  || \
                               ((SOURCE) == RCC_I2C35CLKSOURCE_HSI)   || \
                               ((SOURCE) == RCC_I2C35CLKSOURCE_CSI))
/**
  * @}
  */


/** @defgroup RCCEx_I2C46_Clock_Source I2C46 Clock Source
  * @{
  */
#define RCC_I2C46CLKSOURCE_BCLK         RCC_I2C46CKSELR_I2C46SRC_0
#define RCC_I2C46CLKSOURCE_PLL3         RCC_I2C46CKSELR_I2C46SRC_1
#define RCC_I2C46CLKSOURCE_HSI          RCC_I2C46CKSELR_I2C46SRC_2
#define RCC_I2C46CLKSOURCE_CSI          RCC_I2C46CKSELR_I2C46SRC_3

#define IS_RCC_I2C46CLKSOURCE(SOURCE) \
                              (((SOURCE) == RCC_I2C46CLKSOURCE_BCLK )  || \
                               ((SOURCE) == RCC_I2C46CLKSOURCE_PLL3)   || \
                               ((SOURCE) == RCC_I2C46CLKSOURCE_HSI)    || \
                               ((SOURCE) == RCC_I2C46CLKSOURCE_CSI))
/**
  * @}
  */

/** @defgroup RCCEx_SAI1_Clock_Source SAI1 Clock Source
  * @{
  */
#define RCC_SAI1CLKSOURCE_PLL4         RCC_SAI1CKSELR_SAI1SRC_0
#define RCC_SAI1CLKSOURCE_PLL3_Q       RCC_SAI1CKSELR_SAI1SRC_1
#define RCC_SAI1CLKSOURCE_I2SCKIN      RCC_SAI1CKSELR_SAI1SRC_2
#define RCC_SAI1CLKSOURCE_PER          RCC_SAI1CKSELR_SAI1SRC_3
#define RCC_SAI1CLKSOURCE_PLL3_R       RCC_SAI1CKSELR_SAI1SRC_4

#define IS_RCC_SAI1CLKSOURCE(__SOURCE__) \
                             (((__SOURCE__) == RCC_SAI1CLKSOURCE_PLL4)    || \
                             ((__SOURCE__) == RCC_SAI1CLKSOURCE_PLL3_Q)   || \
                             ((__SOURCE__) == RCC_SAI1CLKSOURCE_I2SCKIN)  || \
                             ((__SOURCE__) == RCC_SAI1CLKSOURCE_PER)      || \
                             ((__SOURCE__) == RCC_SAI1CLKSOURCE_PLL3_R))
/**
  * @}
  */


/** @defgroup RCCEx_SAI2_Clock_Source SAI2 Clock Source
  * @{
  */
#define RCC_SAI2CLKSOURCE_PLL4          RCC_SAI2CKSELR_SAI2SRC_0
#define RCC_SAI2CLKSOURCE_PLL3_Q        RCC_SAI2CKSELR_SAI2SRC_1
#define RCC_SAI2CLKSOURCE_I2SCKIN       RCC_SAI2CKSELR_SAI2SRC_2
#define RCC_SAI2CLKSOURCE_PER           RCC_SAI2CKSELR_SAI2SRC_3
#define RCC_SAI2CLKSOURCE_SPDIF         RCC_SAI2CKSELR_SAI2SRC_4
#define RCC_SAI2CLKSOURCE_PLL3_R        RCC_SAI2CKSELR_SAI2SRC_5


#define IS_RCC_SAI2CLKSOURCE(__SOURCE__) \
                             (((__SOURCE__) == RCC_SAI2CLKSOURCE_PLL4)    || \
                              ((__SOURCE__) == RCC_SAI2CLKSOURCE_PLL3_Q)  || \
                              ((__SOURCE__) == RCC_SAI2CLKSOURCE_I2SCKIN) || \
                              ((__SOURCE__) == RCC_SAI2CLKSOURCE_PER)     || \
                              ((__SOURCE__) == RCC_SAI2CLKSOURCE_SPDIF)   || \
                              ((__SOURCE__) == RCC_SAI2CLKSOURCE_PLL3_R))
/**
  * @}
  */

/** @defgroup RCCEx_SAI3_Clock_Source SAI3 Clock Source
  * @{
  */
#define RCC_SAI3CLKSOURCE_PLL4          RCC_SAI3CKSELR_SAI3SRC_0
#define RCC_SAI3CLKSOURCE_PLL3_Q        RCC_SAI3CKSELR_SAI3SRC_1
#define RCC_SAI3CLKSOURCE_I2SCKIN       RCC_SAI3CKSELR_SAI3SRC_2
#define RCC_SAI3CLKSOURCE_PER           RCC_SAI3CKSELR_SAI3SRC_3
#define RCC_SAI3CLKSOURCE_PLL3_R        RCC_SAI3CKSELR_SAI3SRC_4

#define IS_RCC_SAI3CLKSOURCE(__SOURCE__) \
                             (((__SOURCE__) == RCC_SAI3CLKSOURCE_PLL4)    || \
                              ((__SOURCE__) == RCC_SAI3CLKSOURCE_PLL3_Q)  || \
                              ((__SOURCE__) == RCC_SAI3CLKSOURCE_I2SCKIN) || \
                              ((__SOURCE__) == RCC_SAI3CLKSOURCE_PER)     || \
                              ((__SOURCE__) == RCC_SAI3CLKSOURCE_PLL3_R))
/**
  * @}
  */


