zephyrproject-rtos/zephyr/ext/hal/st/stm32cube/stm32mp1xx/drivers/include/stm32mp1xx_hal_rcc_ex.h
/** @defgroup RCCEx_SAI4_Clock_Source SAI4 Clock Source
  * @{
  */
#define RCC_SAI4CLKSOURCE_PLL4          RCC_SAI4CKSELR_SAI4SRC_0
#define RCC_SAI4CLKSOURCE_PLL3_Q        RCC_SAI4CKSELR_SAI4SRC_1
#define RCC_SAI4CLKSOURCE_I2SCKIN       RCC_SAI4CKSELR_SAI4SRC_2
#define RCC_SAI4CLKSOURCE_PER           RCC_SAI4CKSELR_SAI4SRC_3
#define RCC_SAI4CLKSOURCE_PLL3_R        RCC_SAI4CKSELR_SAI4SRC_4

#define IS_RCC_SAI4CLKSOURCE(__SOURCE__) \
                             (((__SOURCE__) == RCC_SAI4CLKSOURCE_PLL4)    || \
                             ((__SOURCE__) == RCC_SAI4CLKSOURCE_PLL3_Q)   || \
                             ((__SOURCE__) == RCC_SAI4CLKSOURCE_I2SCKIN)  || \
                             ((__SOURCE__) == RCC_SAI4CLKSOURCE_PER)      || \
                             ((__SOURCE__) == RCC_SAI4CLKSOURCE_PLL3_R))
/**
  * @}
  */


/** @defgroup RCCEx_SPI1_Clock_Source SPI/I2S1 Clock Source
  * @{
  */
#define RCC_SPI1CLKSOURCE_PLL4        RCC_SPI2S1CKSELR_SPI1SRC_0
#define RCC_SPI1CLKSOURCE_PLL3_Q      RCC_SPI2S1CKSELR_SPI1SRC_1
#define RCC_SPI1CLKSOURCE_I2SCKIN     RCC_SPI2S1CKSELR_SPI1SRC_2
#define RCC_SPI1CLKSOURCE_PER         RCC_SPI2S1CKSELR_SPI1SRC_3
#define RCC_SPI1CLKSOURCE_PLL3_R      RCC_SPI2S1CKSELR_SPI1SRC_4

#define IS_RCC_SPI1CLKSOURCE(__SOURCE__) \
                             (((__SOURCE__) == RCC_SPI1CLKSOURCE_PLL4)    || \
                              ((__SOURCE__) == RCC_SPI1CLKSOURCE_PLL3_Q)  || \
                              ((__SOURCE__) == RCC_SPI1CLKSOURCE_I2SCKIN) || \
                              ((__SOURCE__) == RCC_SPI1CLKSOURCE_PER)     || \
                              ((__SOURCE__) == RCC_SPI1CLKSOURCE_PLL3_R))
/**
  * @}
  */

/** @defgroup RCCEx_SPI23_Clock_Source SPI/I2S2,3 Clock Source
  * @{
  */
#define RCC_SPI23CLKSOURCE_PLL4       RCC_SPI2S23CKSELR_SPI23SRC_0
#define RCC_SPI23CLKSOURCE_PLL3_Q     RCC_SPI2S23CKSELR_SPI23SRC_1
#define RCC_SPI23CLKSOURCE_I2SCKIN    RCC_SPI2S23CKSELR_SPI23SRC_2
#define RCC_SPI23CLKSOURCE_PER        RCC_SPI2S23CKSELR_SPI23SRC_3
#define RCC_SPI23CLKSOURCE_PLL3_R     RCC_SPI2S23CKSELR_SPI23SRC_4

#define IS_RCC_SPI23CLKSOURCE(__SOURCE__) \
                              (((__SOURCE__) == RCC_SPI23CLKSOURCE_PLL4)    || \
                               ((__SOURCE__) == RCC_SPI23CLKSOURCE_PLL3_Q)  || \
                               ((__SOURCE__) == RCC_SPI23CLKSOURCE_I2SCKIN) || \
                               ((__SOURCE__) == RCC_SPI23CLKSOURCE_PER)     || \
                               ((__SOURCE__) == RCC_SPI23CLKSOURCE_PLL3_R))
/**
  * @}
  */

/** @defgroup RCCEx_SPI45_Clock_Source SPI45 Clock Source
  * @{
  */
#define RCC_SPI45CLKSOURCE_BCLK         RCC_SPI45CKSELR_SPI45SRC_0
#define RCC_SPI45CLKSOURCE_PLL4         RCC_SPI45CKSELR_SPI45SRC_1
#define RCC_SPI45CLKSOURCE_HSI          RCC_SPI45CKSELR_SPI45SRC_2
#define RCC_SPI45CLKSOURCE_CSI          RCC_SPI45CKSELR_SPI45SRC_3
#define RCC_SPI45CLKSOURCE_HSE          RCC_SPI45CKSELR_SPI45SRC_4

#define IS_RCC_SPI45CLKSOURCE(__SOURCE__) \
                              (((__SOURCE__) == RCC_SPI45CLKSOURCE_BCLK) || \
                               ((__SOURCE__) == RCC_SPI45CLKSOURCE_PLL4) || \
                               ((__SOURCE__) == RCC_SPI45CLKSOURCE_HSI)  || \
                               ((__SOURCE__) == RCC_SPI45CLKSOURCE_CSI)  || \
                               ((__SOURCE__) == RCC_SPI45CLKSOURCE_HSE))
/**
  * @}
  */

/** @defgroup RCCEx_SPI6_Clock_Source SPI6 Clock Source
  * @{
  */
#define RCC_SPI6CLKSOURCE_BCLK          RCC_SPI6CKSELR_SPI6SRC_0
#define RCC_SPI6CLKSOURCE_PLL4          RCC_SPI6CKSELR_SPI6SRC_1
#define RCC_SPI6CLKSOURCE_HSI           RCC_SPI6CKSELR_SPI6SRC_2
#define RCC_SPI6CLKSOURCE_CSI           RCC_SPI6CKSELR_SPI6SRC_3
#define RCC_SPI6CLKSOURCE_HSE           RCC_SPI6CKSELR_SPI6SRC_4
#define RCC_SPI6CLKSOURCE_PLL3          RCC_SPI6CKSELR_SPI6SRC_5

#define IS_RCC_SPI6CLKSOURCE(__SOURCE__) \
                             (((__SOURCE__) == RCC_SPI6CLKSOURCE_BCLK)  || \
                              ((__SOURCE__) == RCC_SPI6CLKSOURCE_PLL4)  || \
                              ((__SOURCE__) == RCC_SPI6CLKSOURCE_HSI)   || \
                              ((__SOURCE__) == RCC_SPI6CLKSOURCE_CSI)   || \
                              ((__SOURCE__) == RCC_SPI6CLKSOURCE_HSE)   || \
                              ((__SOURCE__) == RCC_SPI6CLKSOURCE_PLL3))
/**
  * @}
  */


/** @defgroup RCCEx_USART1_Clock_Source USART1 Clock Source
  * @{
  */
#define RCC_USART1CLKSOURCE_BCLK        RCC_UART1CKSELR_UART1SRC_0
#define RCC_USART1CLKSOURCE_PLL3        RCC_UART1CKSELR_UART1SRC_1
#define RCC_USART1CLKSOURCE_HSI         RCC_UART1CKSELR_UART1SRC_2
#define RCC_USART1CLKSOURCE_CSI         RCC_UART1CKSELR_UART1SRC_3
#define RCC_USART1CLKSOURCE_PLL4        RCC_UART1CKSELR_UART1SRC_4
#define RCC_USART1CLKSOURCE_HSE         RCC_UART1CKSELR_UART1SRC_5

#define IS_RCC_USART1CLKSOURCE(SOURCE) \
                               (((SOURCE) == RCC_USART1CLKSOURCE_BCLK)  || \
                                ((SOURCE) == RCC_USART1CLKSOURCE_PLL3)  || \
                                ((SOURCE) == RCC_USART1CLKSOURCE_HSI)   || \
                                ((SOURCE) == RCC_USART1CLKSOURCE_CSI)   || \
                                ((SOURCE) == RCC_USART1CLKSOURCE_PLL4)  || \
                                ((SOURCE) == RCC_USART1CLKSOURCE_HSE))
/**
  * @}
  */

/** @defgroup RCCEx_UART24_Clock_Source UART24 Clock Source
  * @{
  */
#define RCC_UART24CLKSOURCE_BCLK         RCC_UART24CKSELR_UART24SRC_0
#define RCC_UART24CLKSOURCE_PLL4         RCC_UART24CKSELR_UART24SRC_1
#define RCC_UART24CLKSOURCE_HSI          RCC_UART24CKSELR_UART24SRC_2
#define RCC_UART24CLKSOURCE_CSI          RCC_UART24CKSELR_UART24SRC_3
#define RCC_UART24CLKSOURCE_HSE          RCC_UART24CKSELR_UART24SRC_4

#define IS_RCC_UART24CLKSOURCE(SOURCE) \
                               (((SOURCE) == RCC_UART24CLKSOURCE_BCLK)  || \
                                ((SOURCE) == RCC_UART24CLKSOURCE_PLL4)  || \
                                ((SOURCE) == RCC_UART24CLKSOURCE_HSI)   || \
                                ((SOURCE) == RCC_UART24CLKSOURCE_CSI)   || \
                                ((SOURCE) == RCC_UART24CLKSOURCE_HSE))
/**
  * @}
  */

