zephyrproject-rtos/zephyr/ext/hal/st/stm32cube/stm32mp1xx/drivers/include/stm32mp1xx_hal_rcc_ex.h
/** @defgroup RCCEx_UART35_Clock_Source UART35 Clock Source
  * @{
  */
#define RCC_UART35CLKSOURCE_BCLK         RCC_UART35CKSELR_UART35SRC_0
#define RCC_UART35CLKSOURCE_PLL4         RCC_UART35CKSELR_UART35SRC_1
#define RCC_UART35CLKSOURCE_HSI          RCC_UART35CKSELR_UART35SRC_2
#define RCC_UART35CLKSOURCE_CSI          RCC_UART35CKSELR_UART35SRC_3
#define RCC_UART35CLKSOURCE_HSE          RCC_UART35CKSELR_UART35SRC_4

#define IS_RCC_UART35CLKSOURCE(SOURCE) \
                               (((SOURCE) == RCC_UART35CLKSOURCE_BCLK)  || \
                                ((SOURCE) == RCC_UART35CLKSOURCE_PLL4)  || \
                                ((SOURCE) == RCC_UART35CLKSOURCE_HSI)   || \
                                ((SOURCE) == RCC_UART35CLKSOURCE_CSI)   || \
                                ((SOURCE) == RCC_UART35CLKSOURCE_HSE))
/**
  * @}
  */

/** @defgroup RCCEx_USART6_Clock_Source USART6 Clock Source
  * @{
  */
#define RCC_USART6CLKSOURCE_BCLK        RCC_UART6CKSELR_UART6SRC_0
#define RCC_USART6CLKSOURCE_PLL4        RCC_UART6CKSELR_UART6SRC_1
#define RCC_USART6CLKSOURCE_HSI         RCC_UART6CKSELR_UART6SRC_2
#define RCC_USART6CLKSOURCE_CSI         RCC_UART6CKSELR_UART6SRC_3
#define RCC_USART6CLKSOURCE_HSE         RCC_UART6CKSELR_UART6SRC_4

#define IS_RCC_USART6CLKSOURCE(SOURCE) \
                               (((SOURCE) == RCC_USART6CLKSOURCE_BCLK)  || \
                                ((SOURCE) == RCC_USART6CLKSOURCE_PLL4)  || \
                                ((SOURCE) == RCC_USART6CLKSOURCE_HSI)   || \
                                ((SOURCE) == RCC_USART6CLKSOURCE_CSI)   || \
                                ((SOURCE) == RCC_USART6CLKSOURCE_HSE))
/**
  * @}
  */

/** @defgroup RCCEx_UART78_Clock_Source UART78 Clock Source
  * @{
  */
#define RCC_UART78CLKSOURCE_BCLK         RCC_UART78CKSELR_UART78SRC_0
#define RCC_UART78CLKSOURCE_PLL4         RCC_UART78CKSELR_UART78SRC_1
#define RCC_UART78CLKSOURCE_HSI          RCC_UART78CKSELR_UART78SRC_2
#define RCC_UART78CLKSOURCE_CSI          RCC_UART78CKSELR_UART78SRC_3
#define RCC_UART78CLKSOURCE_HSE          RCC_UART78CKSELR_UART78SRC_4

#define IS_RCC_UART78CLKSOURCE(SOURCE) \
                               (((SOURCE) == RCC_UART78CLKSOURCE_BCLK)  || \
                                ((SOURCE) == RCC_UART78CLKSOURCE_PLL4)  || \
                                ((SOURCE) == RCC_UART78CLKSOURCE_HSI)   || \
                                ((SOURCE) == RCC_UART78CLKSOURCE_CSI)   || \
                                ((SOURCE) == RCC_UART78CLKSOURCE_HSE))
/**
  * @}
  */

/** @defgroup RCCEx_SDMMC12_Clock_Source SDMMC12 Clock Source
  * @{
  */
#define RCC_SDMMC12CLKSOURCE_BCLK        RCC_SDMMC12CKSELR_SDMMC12SRC_0
#define RCC_SDMMC12CLKSOURCE_PLL3        RCC_SDMMC12CKSELR_SDMMC12SRC_1
#define RCC_SDMMC12CLKSOURCE_PLL4        RCC_SDMMC12CKSELR_SDMMC12SRC_2
#define RCC_SDMMC12CLKSOURCE_HSI         RCC_SDMMC12CKSELR_SDMMC12SRC_3

#define IS_RCC_SDMMC12CLKSOURCE(SOURCE) \
                                (((SOURCE) == RCC_SDMMC12CLKSOURCE_BCLK)  || \
                                 ((SOURCE) == RCC_SDMMC12CLKSOURCE_PLL3)  || \
                                 ((SOURCE) == RCC_SDMMC12CLKSOURCE_PLL4)  || \
                                 ((SOURCE) == RCC_SDMMC12CLKSOURCE_HSI))
/**
  * @}
  */

/** @defgroup RCCEx_SDMMC3_Clock_Source SDMMC3 Clock Source
  * @{
  */
#define RCC_SDMMC3CLKSOURCE_BCLK       RCC_SDMMC3CKSELR_SDMMC3SRC_0
#define RCC_SDMMC3CLKSOURCE_PLL3       RCC_SDMMC3CKSELR_SDMMC3SRC_1
#define RCC_SDMMC3CLKSOURCE_PLL4       RCC_SDMMC3CKSELR_SDMMC3SRC_2
#define RCC_SDMMC3CLKSOURCE_HSI        RCC_SDMMC3CKSELR_SDMMC3SRC_3

#define IS_RCC_SDMMC3CLKSOURCE(SOURCE)  \
                               (((SOURCE) == RCC_SDMMC3CLKSOURCE_BCLK)  || \
                                ((SOURCE) == RCC_SDMMC3CLKSOURCE_PLL3)  || \
                                ((SOURCE) == RCC_SDMMC3CLKSOURCE_PLL4)  || \
                                ((SOURCE) == RCC_SDMMC3CLKSOURCE_HSI))
/**
  * @}
  */

/** @defgroup RCCEx_ETH_Clock_Source ETH Clock Source
  * @{
  */
#define RCC_ETHCLKSOURCE_PLL4       RCC_ETHCKSELR_ETHSRC_0
#define RCC_ETHCLKSOURCE_PLL3       RCC_ETHCKSELR_ETHSRC_1
#define RCC_ETHCLKSOURCE_OFF        RCC_ETHCKSELR_ETHSRC_2


#define IS_RCC_ETHCLKSOURCE(SOURCE) (((SOURCE) == RCC_ETHCLKSOURCE_PLL4)  || \
                                     ((SOURCE) == RCC_ETHCLKSOURCE_PLL3)  || \
                                     ((SOURCE) == RCC_ETHCLKSOURCE_OFF))
/**
  * @}
  */


/** @defgroup RCCEx_ETH_PrecisionTimeProtocol_Divider ETH PrecisionTimeProtocol Divider
  * @{
  */
#define RCC_ETHPTPDIV_1   RCC_ETHCKSELR_ETHPTPDIV_0   /*Bypass (default after reset*/
#define RCC_ETHPTPDIV_2   RCC_ETHCKSELR_ETHPTPDIV_1   /*Division by 2*/
#define RCC_ETHPTPDIV_3   RCC_ETHCKSELR_ETHPTPDIV_2   /*Division by 3*/
#define RCC_ETHPTPDIV_4   RCC_ETHCKSELR_ETHPTPDIV_3   /*Division by 4*/
#define RCC_ETHPTPDIV_5   RCC_ETHCKSELR_ETHPTPDIV_4   /*Division by 5*/
#define RCC_ETHPTPDIV_6   RCC_ETHCKSELR_ETHPTPDIV_5   /*Division by 6*/
#define RCC_ETHPTPDIV_7   RCC_ETHCKSELR_ETHPTPDIV_6   /*Division by 7*/
#define RCC_ETHPTPDIV_8   RCC_ETHCKSELR_ETHPTPDIV_7   /*Division by 8*/
#define RCC_ETHPTPDIV_9   RCC_ETHCKSELR_ETHPTPDIV_8   /*Division by 9*/
#define RCC_ETHPTPDIV_10  RCC_ETHCKSELR_ETHPTPDIV_9   /*Division by 10*/
#define RCC_ETHPTPDIV_11  RCC_ETHCKSELR_ETHPTPDIV_10  /*Division by 11*/
#define RCC_ETHPTPDIV_12  RCC_ETHCKSELR_ETHPTPDIV_11  /*Division by 12*/
#define RCC_ETHPTPDIV_13  RCC_ETHCKSELR_ETHPTPDIV_12  /*Division by 13*/
#define RCC_ETHPTPDIV_14  RCC_ETHCKSELR_ETHPTPDIV_13  /*Division by 14*/
#define RCC_ETHPTPDIV_15  RCC_ETHCKSELR_ETHPTPDIV_14  /*Division by 15*/
#define RCC_ETHPTPDIV_16  RCC_ETHCKSELR_ETHPTPDIV_15  /*Division by 16*/


#define IS_RCC_ETHPTPDIV(SOURCE)        (((SOURCE) == RCC_ETHPTPDIV_1)  || \
                                         ((SOURCE) == RCC_ETHPTPDIV_2)  || \
                                         ((SOURCE) == RCC_ETHPTPDIV_3)  || \
                                         ((SOURCE) == RCC_ETHPTPDIV_4)  || \
                                         ((SOURCE) == RCC_ETHPTPDIV_5)  || \
                                         ((SOURCE) == RCC_ETHPTPDIV_6)  || \
                                         ((SOURCE) == RCC_ETHPTPDIV_7)  || \
                                         ((SOURCE) == RCC_ETHPTPDIV_8)  || \
                                         ((SOURCE) == RCC_ETHPTPDIV_9)  || \
                                         ((SOURCE) == RCC_ETHPTPDIV_10) || \
                                         ((SOURCE) == RCC_ETHPTPDIV_11) || \
                                         ((SOURCE) == RCC_ETHPTPDIV_12) || \
                                         ((SOURCE) == RCC_ETHPTPDIV_13) || \
                                         ((SOURCE) == RCC_ETHPTPDIV_14) || \
                                         ((SOURCE) == RCC_ETHPTPDIV_15) || \
                                         ((SOURCE) == RCC_ETHPTPDIV_16))
/**
  * @}
  */


/** @defgroup RCCEx_QSPI_Clock_Source QSPI Clock Source
  * @{
  */
#define RCC_QSPICLKSOURCE_BCLK  RCC_QSPICKSELR_QSPISRC_0
#define RCC_QSPICLKSOURCE_PLL3  RCC_QSPICKSELR_QSPISRC_1
#define RCC_QSPICLKSOURCE_PLL4  RCC_QSPICKSELR_QSPISRC_2
#define RCC_QSPICLKSOURCE_PER   RCC_QSPICKSELR_QSPISRC_3

