zephyrproject-rtos/zephyr/ext/hal/st/stm32cube/stm32mp1xx/drivers/include/stm32mp1xx_hal_rcc_ex.h
#define IS_RCC_QSPICLKSOURCE(SOURCE) \
                             (((SOURCE) == RCC_QSPICLKSOURCE_BCLK) || \
                              ((SOURCE) == RCC_QSPICLKSOURCE_PLL3) || \
                              ((SOURCE) == RCC_QSPICLKSOURCE_PLL4) || \
                              ((SOURCE) == RCC_QSPICLKSOURCE_PER))
/**
  * @}
  */

/** @defgroup RCCEx_FMC_Clock_Source FMC Clock Source
  * @{
  */
#define RCC_FMCCLKSOURCE_BCLK       RCC_FMCCKSELR_FMCSRC_0
#define RCC_FMCCLKSOURCE_PLL3       RCC_FMCCKSELR_FMCSRC_1
#define RCC_FMCCLKSOURCE_PLL4       RCC_FMCCKSELR_FMCSRC_2
#define RCC_FMCCLKSOURCE_PER        RCC_FMCCKSELR_FMCSRC_3

#define IS_RCC_FMCCLKSOURCE(SOURCE) (((SOURCE) == RCC_FMCCLKSOURCE_BCLK)  || \
                                     ((SOURCE) == RCC_FMCCLKSOURCE_PLL3)  || \
                                     ((SOURCE) == RCC_FMCCLKSOURCE_PLL4)  || \
                                     ((SOURCE) == RCC_FMCCLKSOURCE_PER))
/**
  * @}
  */

#if defined(FDCAN1)
/** @defgroup RCCEx_FDCAN_Clock_Source FDCAN Clock Source
  * @{
  */
#define RCC_FDCANCLKSOURCE_HSE          RCC_FDCANCKSELR_FDCANSRC_0
#define RCC_FDCANCLKSOURCE_PLL3         RCC_FDCANCKSELR_FDCANSRC_1
#define RCC_FDCANCLKSOURCE_PLL4_Q       RCC_FDCANCKSELR_FDCANSRC_2
#define RCC_FDCANCLKSOURCE_PLL4_R       RCC_FDCANCKSELR_FDCANSRC_3



#define IS_RCC_FDCANCLKSOURCE(SOURCE) \
                              (((SOURCE) == RCC_FDCANCLKSOURCE_HSE)     || \
                               ((SOURCE) == RCC_FDCANCLKSOURCE_PLL3)    || \
                               ((SOURCE) == RCC_FDCANCLKSOURCE_PLL4_Q)  || \
                               ((SOURCE) == RCC_FDCANCLKSOURCE_PLL4_R))
/**
  * @}
  */
#endif /*FDCAN1*/

/** @defgroup RCCEx_SPDIFRX_Clock_Source SPDIFRX Clock Source
  * @{
  */
#define RCC_SPDIFRXCLKSOURCE_PLL4         RCC_SPDIFCKSELR_SPDIFSRC_0
#define RCC_SPDIFRXCLKSOURCE_PLL3         RCC_SPDIFCKSELR_SPDIFSRC_1
#define RCC_SPDIFRXCLKSOURCE_HSI          RCC_SPDIFCKSELR_SPDIFSRC_2

#define IS_RCC_SPDIFRXCLKSOURCE(SOURCE) \
                                (((SOURCE) == RCC_SPDIFRXCLKSOURCE_PLL4)  || \
                                 ((SOURCE) == RCC_SPDIFRXCLKSOURCE_PLL3)  || \
                                 ((SOURCE) == RCC_SPDIFRXCLKSOURCE_HSI))
/**
  * @}
  */

/** @defgroup RCCEx_CEC_Clock_Source CEC Clock Source
  * @{
  */
#define RCC_CECCLKSOURCE_LSE            RCC_CECCKSELR_CECSRC_0
#define RCC_CECCLKSOURCE_LSI            RCC_CECCKSELR_CECSRC_1
#define RCC_CECCLKSOURCE_CSI122         RCC_CECCKSELR_CECSRC_2

#define IS_RCC_CECCLKSOURCE(SOURCE)     (((SOURCE) == RCC_CECCLKSOURCE_LSE) || \
                                         ((SOURCE) == RCC_CECCLKSOURCE_LSI) || \
                                         ((SOURCE) == RCC_CECCLKSOURCE_CSI122))
/**
  * @}
  */

/** @defgroup RCCEx_USBPHY_Clock_Source USBPHY Clock Source
  * @{
  */
#define RCC_USBPHYCLKSOURCE_HSE         RCC_USBCKSELR_USBPHYSRC_0
#define RCC_USBPHYCLKSOURCE_PLL4        RCC_USBCKSELR_USBPHYSRC_1
#define RCC_USBPHYCLKSOURCE_HSE2        RCC_USBCKSELR_USBPHYSRC_2

#define IS_RCC_USBPHYCLKSOURCE(SOURCE) \
                               (((SOURCE) == RCC_USBPHYCLKSOURCE_HSE) || \
                                ((SOURCE) ==RCC_USBPHYCLKSOURCE_PLL4) || \
                                ((SOURCE) ==RCC_USBPHYCLKSOURCE_HSE2))
/**
  * @}
  */

/** @defgroup RCCEx_USBO_Clock_Source USBO Clock Source
  * @{
  */
#define RCC_USBOCLKSOURCE_PLL4            RCC_USBCKSELR_USBOSRC_0
#define RCC_USBOCLKSOURCE_PHY             RCC_USBCKSELR_USBOSRC_1

#define IS_RCC_USBOCLKSOURCE(SOURCE)  (((SOURCE) == RCC_USBOCLKSOURCE_PLL4) || \
                                       ((SOURCE) == RCC_USBOCLKSOURCE_PHY))
/**
  * @}
  */


/** @defgroup RCCEx_RNG1_Clock_Source RNG1 Clock Source
  * @{
  */
#define RCC_RNG1CLKSOURCE_CSI         RCC_RNG1CKSELR_RNG1SRC_0
#define RCC_RNG1CLKSOURCE_PLL4        RCC_RNG1CKSELR_RNG1SRC_1
#define RCC_RNG1CLKSOURCE_LSE         RCC_RNG1CKSELR_RNG1SRC_2
#define RCC_RNG1CLKSOURCE_LSI         RCC_RNG1CKSELR_RNG1SRC_3

#define IS_RCC_RNG1CLKSOURCE(SOURCE)  (((SOURCE) == RCC_RNG1CLKSOURCE_CSI)  || \
                                       ((SOURCE) == RCC_RNG1CLKSOURCE_PLL4) || \
                                       ((SOURCE) == RCC_RNG1CLKSOURCE_LSE)  || \
                                       ((SOURCE) == RCC_RNG1CLKSOURCE_LSI))

/**
  * @}
  */


/** @defgroup RCCEx_RNG2_Clock_Source RNG2 Clock Source
  * @{
  */
#define RCC_RNG2CLKSOURCE_CSI         RCC_RNG2CKSELR_RNG2SRC_0
#define RCC_RNG2CLKSOURCE_PLL4        RCC_RNG2CKSELR_RNG2SRC_1
#define RCC_RNG2CLKSOURCE_LSE         RCC_RNG2CKSELR_RNG2SRC_2
#define RCC_RNG2CLKSOURCE_LSI         RCC_RNG2CKSELR_RNG2SRC_3

#define IS_RCC_RNG2CLKSOURCE(SOURCE)  (((SOURCE) == RCC_RNG2CLKSOURCE_CSI)  || \
                                       ((SOURCE) == RCC_RNG2CLKSOURCE_PLL4) || \
                                       ((SOURCE) == RCC_RNG2CLKSOURCE_LSE)  || \
                                       ((SOURCE) == RCC_RNG2CLKSOURCE_LSI))

/**
  * @}
  */


/** @defgroup RCCEx_CKPER_Clock_Source CKPER Clock Source
  * @{
  */
#define RCC_CKPERCLKSOURCE_HSI          RCC_CPERCKSELR_CKPERSRC_0
#define RCC_CKPERCLKSOURCE_CSI          RCC_CPERCKSELR_CKPERSRC_1
#define RCC_CKPERCLKSOURCE_HSE          RCC_CPERCKSELR_CKPERSRC_2
#define RCC_CKPERCLKSOURCE_OFF          RCC_CPERCKSELR_CKPERSRC_3 /*Clock disabled*/

#define IS_RCC_CKPERCLKSOURCE(SOURCE) (((SOURCE) == RCC_CKPERCLKSOURCE_HSI) || \
                                       ((SOURCE) == RCC_CKPERCLKSOURCE_CSI) || \
                                       ((SOURCE) == RCC_CKPERCLKSOURCE_HSE) || \
                                       ((SOURCE) == RCC_CKPERCLKSOURCE_OFF))
/**
  * @}
  */


/** @defgroup RCCEx_STGEN_Clock_Source STGEN Clock Source
  * @{
  */
#define RCC_STGENCLKSOURCE_HSI          RCC_STGENCKSELR_STGENSRC_0
#define RCC_STGENCLKSOURCE_HSE          RCC_STGENCKSELR_STGENSRC_1
#define RCC_STGENCLKSOURCE_OFF          RCC_STGENCKSELR_STGENSRC_2

#define IS_RCC_STGENCLKSOURCE(SOURCE) \
                              (((SOURCE) == RCC_STGENCLKSOURCE_HSI) || \
                               ((SOURCE) == RCC_STGENCLKSOURCE_HSE) || \
                               ((SOURCE) == RCC_STGENCLKSOURCE_OFF))
/**
  * @}
  */

