zephyrproject-rtos/zephyr/ext/hal/st/stm32cube/stm32mp1xx/drivers/include/stm32mp1xx_hal_rcc_ex.h
#if defined(DSI)
/** @defgroup RCCEx_DSI_Clock_Source  DSI Clock Source
  * @{
  */
#define RCC_DSICLKSOURCE_PHY            RCC_DSICKSELR_DSISRC_0
#define RCC_DSICLKSOURCE_PLL4           RCC_DSICKSELR_DSISRC_1

#define IS_RCC_DSICLKSOURCE(__SOURCE__) \
                            (((__SOURCE__) == RCC_DSICLKSOURCE_PHY)  || \
                             ((__SOURCE__) == RCC_DSICLKSOURCE_PLL4))
/**
  * @}
  */
#endif /*DSI*/

/** @defgroup RCCEx_ADC_Clock_Source ADC Clock Source
  * @{
  */
#define RCC_ADCCLKSOURCE_PLL4           RCC_ADCCKSELR_ADCSRC_0
#define RCC_ADCCLKSOURCE_PER            RCC_ADCCKSELR_ADCSRC_1
#define RCC_ADCCLKSOURCE_PLL3           RCC_ADCCKSELR_ADCSRC_2

#define IS_RCC_ADCCLKSOURCE(SOURCE) (((SOURCE) == RCC_ADCCLKSOURCE_PLL4)  || \
                                     ((SOURCE) == RCC_ADCCLKSOURCE_PER)   || \
                                     ((SOURCE) == RCC_ADCCLKSOURCE_PLL3))
/**
  * @}
  */


/** @defgroup RCCEx_LPTIM1_Clock_Source LPTIM1 Clock Source
  * @{
  */
#define RCC_LPTIM1CLKSOURCE_BCLK        RCC_LPTIM1CKSELR_LPTIM1SRC_0
#define RCC_LPTIM1CLKSOURCE_PLL4        RCC_LPTIM1CKSELR_LPTIM1SRC_1
#define RCC_LPTIM1CLKSOURCE_PLL3        RCC_LPTIM1CKSELR_LPTIM1SRC_2
#define RCC_LPTIM1CLKSOURCE_LSE         RCC_LPTIM1CKSELR_LPTIM1SRC_3
#define RCC_LPTIM1CLKSOURCE_LSI         RCC_LPTIM1CKSELR_LPTIM1SRC_4
#define RCC_LPTIM1CLKSOURCE_PER         RCC_LPTIM1CKSELR_LPTIM1SRC_5
#define RCC_LPTIM1CLKSOURCE_OFF         RCC_LPTIM1CKSELR_LPTIM1SRC_6

#define IS_RCC_LPTIM1CLKSOURCE(SOURCE) \
                               (((SOURCE) == RCC_LPTIM1CLKSOURCE_BCLK)  || \
                                ((SOURCE) == RCC_LPTIM1CLKSOURCE_PLL4)  || \
                                ((SOURCE) == RCC_LPTIM1CLKSOURCE_PLL3)  || \
                                ((SOURCE) == RCC_LPTIM1CLKSOURCE_LSE)   || \
                                ((SOURCE) == RCC_LPTIM1CLKSOURCE_LSI)   || \
                                ((SOURCE) == RCC_LPTIM1CLKSOURCE_PER)   || \
                                ((SOURCE) == RCC_LPTIM1CLKSOURCE_OFF))
/**
  * @}
  */

/** @defgroup RCCEx_LPTIM23_Clock_Source LPTIM23 Clock Source
  * @{
  */
#define RCC_LPTIM23CLKSOURCE_BCLK        RCC_LPTIM23CKSELR_LPTIM23SRC_0
#define RCC_LPTIM23CLKSOURCE_PLL4        RCC_LPTIM23CKSELR_LPTIM23SRC_1
#define RCC_LPTIM23CLKSOURCE_PER         RCC_LPTIM23CKSELR_LPTIM23SRC_2
#define RCC_LPTIM23CLKSOURCE_LSE         RCC_LPTIM23CKSELR_LPTIM23SRC_3
#define RCC_LPTIM23CLKSOURCE_LSI         RCC_LPTIM23CKSELR_LPTIM23SRC_4
#define RCC_LPTIM23CLKSOURCE_OFF         RCC_LPTIM23CKSELR_LPTIM23SRC_5


#define IS_RCC_LPTIM23CLKSOURCE(SOURCE) \
                               (((SOURCE) == RCC_LPTIM23CLKSOURCE_BCLK)  || \
                                ((SOURCE) == RCC_LPTIM23CLKSOURCE_PLL4)  || \
                                ((SOURCE) == RCC_LPTIM23CLKSOURCE_PER)   || \
                                ((SOURCE) == RCC_LPTIM23CLKSOURCE_LSE)   || \
                                ((SOURCE) == RCC_LPTIM23CLKSOURCE_LSI)   || \
                                ((SOURCE) == RCC_LPTIM23CLKSOURCE_OFF))
/**
  * @}
  */

/** @defgroup RCCEx_LPTIM45_Clock_Source LPTIM45 Clock Source
  * @{
  */
#define RCC_LPTIM45CLKSOURCE_BCLK       RCC_LPTIM45CKSELR_LPTIM45SRC_0
#define RCC_LPTIM45CLKSOURCE_PLL4       RCC_LPTIM45CKSELR_LPTIM45SRC_1
#define RCC_LPTIM45CLKSOURCE_PLL3       RCC_LPTIM45CKSELR_LPTIM45SRC_2
#define RCC_LPTIM45CLKSOURCE_LSE        RCC_LPTIM45CKSELR_LPTIM45SRC_3
#define RCC_LPTIM45CLKSOURCE_LSI        RCC_LPTIM45CKSELR_LPTIM45SRC_4
#define RCC_LPTIM45CLKSOURCE_PER        RCC_LPTIM45CKSELR_LPTIM45SRC_5
#define RCC_LPTIM45CLKSOURCE_OFF        RCC_LPTIM45CKSELR_LPTIM45SRC_6



#define IS_RCC_LPTIM45CLKSOURCE(SOURCE) \
                                (((SOURCE) == RCC_LPTIM45CLKSOURCE_BCLK)  || \
                                 ((SOURCE) == RCC_LPTIM45CLKSOURCE_PLL4)  || \
                                 ((SOURCE) == RCC_LPTIM45CLKSOURCE_PLL3)  || \
                                 ((SOURCE) == RCC_LPTIM45CLKSOURCE_LSE)   || \
                                 ((SOURCE) == RCC_LPTIM45CLKSOURCE_LSI)   || \
                                 ((SOURCE) == RCC_LPTIM45CLKSOURCE_PER)   || \
                                 ((SOURCE) == RCC_LPTIM45CLKSOURCE_OFF))
/**
  * @}
  */


/** @defgroup RCCEx_TIMG1_Prescaler_Selection TIMG1 Prescaler Selection
  * @{
  */
#define RCC_TIMG1PRES_DEACTIVATED                RCC_TIMG1PRER_TIMG1PRE_0
#define RCC_TIMG1PRES_ACTIVATED                  RCC_TIMG1PRER_TIMG1PRE_1

#define IS_RCC_TIMG1PRES(PRES)  (((PRES) == RCC_TIMG1PRES_DEACTIVATED)    || \
                                ((PRES) == RCC_TIMG1PRES_ACTIVATED))
/**
  * @}
  */


/** @defgroup RCCEx_TIMG2_Prescaler_Selection TIMG2 Prescaler Selection
  * @{
  */
#define RCC_TIMG2PRES_DEACTIVATED                RCC_TIMG2PRER_TIMG2PRE_0
#define RCC_TIMG2PRES_ACTIVATED                  RCC_TIMG2PRER_TIMG2PRE_1

#define IS_RCC_TIMG2PRES(PRES)  (((PRES) == RCC_TIMG2PRES_DEACTIVATED)    || \
                                ((PRES) == RCC_TIMG2PRES_ACTIVATED))
/**
  * @}
  */


/** @defgroup RCCEx_RCC_BootCx RCC BootCx
  * @{
  */
#define RCC_BOOT_C1                     RCC_MP_BOOTCR_MPU_BEN
#define RCC_BOOT_C2                     RCC_MP_BOOTCR_MCU_BEN

#define IS_RCC_BOOT_CORE(CORE)          (((CORE) == RCC_BOOT_C1)  || \
                                         ((CORE) == RCC_BOOT_C2)  || \
                                         ((CORE) == (RCC_BOOT_C1 ||RCC_BOOT_C2) ))
/**
  * @}
  */
/**
  * @}
  */

/* Exported macros -----------------------------------------------------------*/
/** @defgroup RCCEx_Exported_Macros RCCEx Exported Macros
 * @{
 */
/** @brief macro to configure the I2C12 clock (I2C12CLK).
  *
  * @param  __I2C12CLKSource__: specifies the I2C12 clock source.
  *          This parameter can be one of the following values:
  *            @arg RCC_I2C12CLKSOURCE_BCLK:   PCLK1 selected as I2C12 clock (default after reset)
  *            @arg RCC_I2C12CLKSOURCE_PLL4:   PLL4_R selected as I2C12 clock
  *            @arg RCC_I2C12CLKSOURCE_HSI:    HSI selected as I2C12 clock
  *            @arg RCC_I2C12CLKSOURCE_CSI:    CSI selected as I2C12 clock
  * @retval None
  */
#define __HAL_RCC_I2C12_CONFIG(__I2C12CLKSource__) \
                  MODIFY_REG(RCC->I2C12CKSELR, RCC_I2C12CKSELR_I2C12SRC, (uint32_t)(__I2C12CLKSource__))

